posts/2021-05-19-seguridad-sobrevalorada.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-23 do. 01:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Twitter #1 - Seguridad sobrevalorada</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jorge Benavides M." />
<meta name="description" content="He quitado el passphrase de mi clave SSH."
 />
<link rel="stylesheet" type="text/css" href="./../org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./../org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="./../org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<link rel="icon" type="image/png" href="./../../images/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Twitter #1 - Seguridad sobrevalorada</h1>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 08:20&gt;</span></span>
He quitado la contraseña de mi clave ssh, por casualidad he intentado clonar algo desde magit y ha funcionado. ¡Genial! Pero es aún mejor he intentado hacer un pull y ha ido mejor todavía, seguiré haciendo pruebas durante el día.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 10:49&gt;</span></span>
Vale, con el magit puedo trabajar sin problemas, ahora que eliminar lo que había hecho y hacer una función para publicar esto, una lista de tareas que seguir y mucho mucho más, esto no me viene nada bien soy un procrastinador (el primer paso para superarlo es aceptarlo), así que tengo dos opciones, tomarme esto de EMACS con más calma y ponerme a estudiar o hacer la función, seamos realistas quiero que todo funcione así que intentaré hacerlo en 10 minutos sino funciona, apaga y vámonos que tengo examen el sábado.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 11:03&gt;</span></span>
No he podido hacerlo en 10 minutos, gg, sé lo que tengo que hacer pero no sé si es más cómodo usar git.exe o magit, por lo que he mirado en <a href="https://emacs.stackexchange.com/questions/41572/modify-last-commits-message-and-push-to-upstream">stackexchange</a> lo primero es más fácil, seguiré informando.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 12:02&gt;</span></span>
He revisado mi nota de electrónica digital en una tutoría, si un suspenso como una casa, no hay que desanimarse, todavía puedo aprobar, pero tengo que distribuir mejor mi tiempo, aprobar electrónica el sábado y empresa la próxima semana, adiós emacs portable, nos vemos dentro de un mes, hola Twitter/blog, necesito quejarme en algún sitio y twitter trae demasiadas interacciones.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 16:22&gt;</span></span>
No sé que pequeña diferencia puede existir entre entender las leyes de kirckhoff y no entenderlas, si sabes aplicarlas todos los circuitos tienen mucho sentido.
Una cosa más, solo tienes miedo si tienes miedo.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 18:42&gt;</span></span>
He descargado otro libro sobre funciones de transferencia, debo empezar a organizar mi nube/ordenador/biblioteca tengo demasiados libros que me gustaría leer y o que me he leído, uso para consulta, etc&#x2026; y los tengo dispersos en todos lados, tal vez un .org me ayudaría a organizarlos.
Por cierto el libro que he conseguido es <a href="https://ieeexplore.ieee.org/book/7470658">Linear Circuit Transfer Functions: An Introduction to Fast Analytical Techniques, Christophe P. Basso</a>. Es la primera vez que lo tengo entre mis manos, así que poco puedo decir de él, pero tiene buena pinta lo he ojeado y merece la pena. Debo incluir una sección de reseñas o libros que recomiendo puede ser parte del .org que quiero crear, si tan solo tuviera más tiempo para organizarlo todo y enterarme de como se crean carpetas con org-static-blog.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 18:50&gt;</span></span>
Debería descargar todo de electrónica y pasarlo a un libro, lo haré este domingo, quiero y necesito toda la información del campus, incluye el foro que espero poder guardar.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-19 mi. 23:55&gt;</span></span>
Llevo horas buscando una solución para la función de transferencia de un oscilador Colpitts, como mínimo espero aprenderme el nombre.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-05-19 mi. 09:08</p>
<p class="author">Author: Jorge Benavides M.</p>
<p class="date">Created: 2021-05-23 do. 01:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
